* Ingredients
  |-----------------------------------+----------------+----------------+--------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------|
  | Ingredient                        | Package weight | Package volume |   Cost | Serving weight | Serving volume | Serving calories | Serving protein | Serving fat | Serving backpacking weight | Serving backpacking volume | Cost / 1000 calories | Cost / 100 g protein | Tags      | Note                                                                                                                                               |
  |-----------------------------------+----------------+----------------+--------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------|
  | 10oz can mushroom gravy           |                | 284ml          |   1.59 |                | 1/4 cup        |               20 | 1g              | 1g          |                            | 10oz                       |               16.796 |               33.592 |           | Franco-American                                                                                                                                    |
  | 10oz can mushrooms                |                | 284ml          |   0.97 |                | 1/2 cup        |               35 | 2g              | 0g          |                            |                            |               11.710 |               20.493 |           |                                                                                                                                                    |
  | 13oz can tomato paste             |                | 369ml          |   1.89 |                | 2 tbsp         |               20 | 1g              | 0g          |                            |                            |                7.683 |               15.366 |           | Hunt's                                                                                                                                             |
  | 14oz can pineapple tidbits        |                | 398ml          |   0.97 |                | 125ml          |               70 | 1g              | 0g          |                            |                            |                4.352 |               30.465 |           | Dole                                                                                                                                               |
  | 15oz can tomato sauce             |                | 398ml          |   1.79 |                | 1/2 cup        |               50 |                 |             |                            |                            |               10.794 |                      |           |                                                                                                                                                    |
  | 19oz can black beans              |                | 540ml          |   0.87 |                | 1/2 cup        |              130 | 9g              | 1g          |                            |                            |                1.487 |                2.148 |           |                                                                                                                                                    |
  | 19oz can chickpeas                |                | 540ml          |   0.87 |                | 1 cup          |              220 | 10g             | 4g          |                            |                            |                1.758 |                3.867 |           |                                                                                                                                                    |
  | 19oz can kidney beans             |                | 540ml          |   0.87 |                | 1 cup          |              200 | 12g             | 1g          |                            |                            |                1.933 |                3.222 |           |                                                                                                                                                    |
  | 19oz can navy beans               |                | 540ml          |   0.87 |                | 1 cup          |              210 | 14g             | 1g          |                            |                            |                1.841 |                2.762 |           |                                                                                                                                                    |
  | 19oz can tomato juice             |                | 540ml          |   0.94 |                | 1 cup          |               45 | 3g              | 0g          |                            |                            |                9.284 |               13.926 |           |                                                                                                                                                    |
  | 19oz can white kidney beans       |                | 540ml          |   0.87 |                | 1 cup          |              200 | 14g             | 1g          |                            |                            |                1.933 |                2.762 |           |                                                                                                                                                    |
  | 28oz can crushed tomatoes         |                | 796ml          |   1.19 |                | 1/2 cup        |               50 | 3g              | 0g          |                            |                            |                3.588 |                5.980 |           |                                                                                                                                                    |
  | 28oz can diced tomatoes           |                | 796ml          |   1.19 |                | 1/2 cup        |               30 | 1g              | 0g          |                            |                            |                5.980 |               17.940 |           |                                                                                                                                                    |
  | 6oz can tomato paste              |                | 156ml          |   0.69 |                | 2 tbsp         |               20 | 1g              | 0g          |                            |                            |                6.635 |               13.269 |           |                                                                                                                                                    |
  | 7oz can jalapenos                 |                | 200ml          |   0.99 |                | 30ml           |                5 |                 |             |                            |                            |               29.700 |                      |           |                                                                                                                                                    |
  | 7oz can olives                    |                | 200ml          |   1.09 | 15g            | 1 tbsp         |               20 |                 |             |                            |                            |                4.088 |                      |           |                                                                                                                                                    |
  | Apples                            | 1lb            |                |   1.69 | 185g           | 1              |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Beef Jerky                        | 230g           |                |   7.99 | 23g            |                |               70 | 12g             | 0.5g        |                            |                            |               11.414 |                6.658 |           |                                                                                                                                                    |
  | Equal sweetener packets           |                | 800            |  15.99 |                | 1              |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Ichiban                           | 100g           |                |   0.74 | 100g           |                |              470 | 10g             | 20g         |                            |                            |                1.574 |                7.400 |           |                                                                                                                                                    |
  | Knorr tomato-vegetable soup       | 71g            |                |   1.77 | 18g            |                |               60 | 2g              | 1g          |                            |                            |                7.479 |               22.437 |           |                                                                                                                                                    |
  | Kool-aid powder                   | 6g             |                |   0.58 | 0.8g           |                |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Kraft Dinner                      | 225g           |                | 1.2475 | 56g            |                |              210 | 7g              | 2g          |                            |                            |                1.479 |                4.436 |           | 12 pack from walmart                                                                                                                               |
  | Kraft Dinner Sharp                | 200g           |                |   1.87 | 50g            |                |              180 | 6g              | 1.5g        |                            |                            |                2.597 |                7.792 |           |                                                                                                                                                    |
  | Kraft Dinner Spirals              | 175g           |                |   1.87 | 44g            |                |              160 | 6g              | 1.5g        |                            |                            |                2.939 |                7.836 |           |                                                                                                                                                    |
  | Large ziplock                     |                | 90             |  10.47 | 12g            | 1              |                0 | 0g              | 0g          |                            |                            |                      |                      | packaging | from superstore, big pack                                                                                                                          |
  | Lipton Tomato Cup-a-soup          | 88g            | 4              |   1.77 | 22g            |                |               80 | 2g              | 1.5g        |                            |                            |                5.531 |               22.125 |           |                                                                                                                                                    |
  | M&Ms                              | 400g           |                |   4.94 | 40g            | 1/4 cup        |              200 | 2g              | 8g          |                            |                            |                2.470 |               24.700 |           |                                                                                                                                                    |
  | Medium ziplock                    |                | 120            |  10.47 | 6.8g           | 1              |                0 | 0g              | 0g          |                            |                            |                      |                      | packaging | from superstore, big pack                                                                                                                          |
  | Oranges                           | 1lb            |                |   1.69 | 172g           | 1              |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Organic veggie boulion cube       | 66g            |                |   2.99 | 3.7g           |                |               11 | 0g              | 1g          |                            |                            |               15.238 |                      |           | Gobio                                                                                                                                              |
  | PC decadent chocolate chip cookie | 500g           |                |   4.27 | 34g            |                |              170 | 2g              | 8g          |                            |                            |                1.708 |               14.518 |           |                                                                                                                                                    |
  | Parmesan cheese                   | 500g           |                |  10.49 | 12g            | 2 tbsp         |               50 | 4g              | 4g          |                            |                            |                5.035 |                6.294 |           |                                                                                                                                                    |
  | Peaches                           | 1lb            |                |   1.69 | 148g           | 1              |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Powdered Lemonade                 | 2.2kg          |                |   9.97 | 31g            | 2 tbsp         |              120 | 0g              | 0g          |                            |                            |                1.171 |                      |           |                                                                                                                                                    |
  | Power Bar Protein Plus            | 61g            |                |   2.44 | 61g            |                |              210 | 20g             | 5g          |                            |                            |               11.619 |               12.200 |           |                                                                                                                                                    |
  | Tang                              | 2.2kg          |                |   9.97 | 31g            | 2 tbsp         |              120 | 0g              | 0g          |                            |                            |                1.171 |                      |           |                                                                                                                                                    |
  | Tobasco sauce                     |                | 350ml          |  11.39 |                | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | Worcestershire sauce              |                | 291ml          |   2.00 |                | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | bacon                             | 500g           |                |   3.98 | 50g            |                |              200 | 4g              | 19g         |                            |                            |                1.990 |                9.950 |           | TODO                                                                                                                                               |
  | baking powder                     | 450g           |                |   5.99 | 1g             | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | baking soda                       | 2kg            |                |   3.97 | 5.5g           | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | balsamic vinegar                  |                | 500ml          |   3.17 |                | 1 tbsp         |               15 | 0.1g            | 0g          |                            |                            |                6.340 |               95.100 |           |                                                                                                                                                    |
  | bannana chips                     | 100g           |                |   0.99 | 100g           | 1.23 cup       |              519 | 2.3g            | 33.6g       |                            |                            |                1.908 |               43.043 |           | Not sure if these are right, need to investigate [[http://www.calorieking.com/foods/calories-in-other-chips-or-crisps-banana_f-ZmlkPTY5Nzcz.html]] |
  | bell pepper                       |                | 3              |   3.97 |                |                |                  |                 |             |                            |                            |                      |                      |           | TODO                                                                                                                                               |
  | bisquick                          | 1kg            |                |   3.69 | 40g            | 1/3 cup        |              160 | 2g              | 4g          |                            |                            |                0.922 |                7.380 |           |                                                                                                                                                    |
  | black lentils                     |                |                |        |                |                |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | black pepper                      | 400g           |                |   6.29 | 0.5g           | 1/4tsp         |                0 | 0.1             | 0g          |                            |                            |                      |                7.862 |           |                                                                                                                                                    |
  | bran flakes                       | 980g           |                |   5.98 | 30g            | 3/4 cup        |               97 | 2.9g            | 0.6g        |                            | 3/4 cup                    |                1.887 |                6.312 |           | Post, but kellogs similar                                                                                                                          |
  | brazil nuts                       | 100g           |                |   2.98 | 40g            | 1/4 cup        |              280 | 6g              | 26g         |                            |                            |                4.257 |               19.867 |           |                                                                                                                                                    |
  | bread flour                       | 5kg            |                |   8.97 | 30g            | 1/4 cup        |              100 | 4g              | 0.3g        |                            |                            |                0.538 |                1.346 |           |                                                                                                                                                    |
  | brown rice                        | 2kg            |                |   4.99 | 45g            | 1/4 cup        |              160 | 3g              | 1.5g        |                            |                            |                0.702 |                3.743 |           |                                                                                                                                                    |
  | buttermilk                        |                | 1L             |   2.27 |                | 1 cup          |              110 |                 |             |                            |                            |                4.953 |                      |           |                                                                                                                                                    |
  | cake flour                        | 2kg            |                |   3.48 | 30g            | 1/4 cup        |              110 | 3g              | 0.5g        |                            |                            |                0.475 |                1.740 |           |                                                                                                                                                    |
  | can coke                          |                | 12 oz          |   0.99 |                | 12 oz          |              143 | 0g              | 0g          |                            |                            |                6.923 |                      |           |                                                                                                                                                    |
  | cans tuna                         | 120g           | 1              |   0.97 | 60g            | 1/2            |               60 | 15g             | 0g          |                            |                            |                8.083 |                3.233 |           |                                                                                                                                                    |
  | capellini                         | 900g           |                |   1.77 | 85g            |                |              310 | 11g             | 1.5g        |                            |                            |                0.539 |                1.520 |           |                                                                                                                                                    |
  | carrots                           | 908g           |                |   1.97 | 130g           | 1 cup          |            54.54 | 1.23g           | 0.35g       |                            |                            |                5.171 |               22.931 |           | 2lb bag, diced                                                                                                                                     |
  | cashews                           | 908g           |                |  12.98 | 30g            | 1/4 cup        |              180 | 6g              | 14g         |                            | 1/4 cup                    |                2.383 |                7.148 |           |                                                                                                                                                    |
  | celery                            | 993g           |                |   1.18 | 127g           | 1 cup          |            26.58 | 1.18            | 0.295       |                            |                            |                5.678 |               12.790 |           |                                                                                                                                                    |
  | cherrios                          | 525g           |                |   5.97 | 28g            | 1 cup          |              103 | 3.55g           | 1.77g       |                            | 1 cup                      |                3.091 |                8.969 |           |                                                                                                                                                    |
  | chex                              | 365g           |                |   4.00 | 27g            | 1 cup          |              103 | 2g              | 0g          |                            |                            |                2.873 |               14.795 |           |                                                                                                                                                    |
  | chilli powder                     | 500g           |                |   4.79 | 1g             | 1/2 tsp        |                5 | 0.1g            | 0g          |                            |                            |                1.916 |                9.580 |           | Sunspun                                                                                                                                            |
  | chocolate chips                   | 300g           |                |   2.47 | 15g            | 1 tbsp         |               80 | 1g              | 4g          |                            | 1 tbsp                     |                1.544 |               12.350 |           |                                                                                                                                                    |
  | cinnamon                          | 150g           |                |   2.10 | 0.5g           | 1/4 tsp        |                0 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | cliff bar builders                | 68g            |                |        | 68g            |                |              270 | 20g             | 9g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | cloves garlic                     | 58g            | 12             |   0.23 | 4.8333g        | 1              |            8.955 | 0.379g          | 0.03g       |                            |                            |                2.140 |                5.057 |           | 195g for 3 bulbs garlic for 0.58                                                                                                                   |
  | coconut milk                      |                | 398 ml         |        |                | 4 tbsp         |              120 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | coconut oil                       |                | 250ml          |   1.79 |                | 2 tsp          |               80 | 0g              | 7.8g        |                            |                            |                0.895 |                      |           |                                                                                                                                                    |
  | cooking wine                      |                | 500ml          |   5.99 |                |                |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | corn flakes                       | 680g           |                |   4.58 | 28g            | 1 cup          |              101 | 2g              | 0g          |                            |                            |                1.867 |                9.429 |           |                                                                                                                                                    |
  | corn starch                       | 500g           |                |   1.78 | 10g            | 1 tbsp         |               35 | 0g              | 0g          |                            |                            |                1.017 |                      |           | (no name)                                                                                                                                          |
  | corn syrup                        |                | 1L             |   4.99 |                | 2 tbsp         |              130 | 0g              | 0g          |                            |                            |                1.152 |                      |           |                                                                                                                                                    |
  | cornmeal                          | 750g           |                |   2.49 | 40g            | 1/4 cup        |              140 | 3g              | 0.3g        |                            |                            |                0.949 |                4.427 |           |                                                                                                                                                    |
  | cottage cheese                    | 500g           | 16oz           |   3.49 | 125g           | 1/2 cup        |              100 | 14g             | 2.5g        |                            |                            |                8.725 |                6.232 |           | 2%                                                                                                                                                 |
  | couscous                          | 500g           |                |   2.49 | 50g            | 1/4 cup        |              190 | 6g              | 0.3g        |                            |                            |                1.311 |                4.150 |           |                                                                                                                                                    |
  | cream of tartar                   | 113g           |                |   8.99 |                |                |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | cream of wheat                    | 800g           |                |   3.99 | 30g            | 3 tbsp         |              100 |                 |             |                            |                            |                1.496 |                      |           |                                                                                                                                                    |
  | creamy icing                      | 450g           |                |   3.98 | 33g            | 2 tbsp         |              130 | 0.5g            | 5g          |                            |                            |                2.245 |               58.373 |           | TODO REDO                                                                                                                                          |
  | cumin                             | 97g            |                |   2.56 | 0.5g           | 1/4 tsp        |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | currants                          | 375g           |                |   3.98 | 40g            | 1/4 cup        |              130 |                 |             |                            |                            |                3.266 |                      |           |                                                                                                                                                    |
  | curry powder                      | 45g            |                |   6.89 | 0.5g           | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | dark brown sugar                  | 1kg            |                |   2.27 | 12g            | 1 tbsp         |               48 | 0g              | 0g          |                            |                            |                0.568 |                      |           |                                                                                                                                                    |
  | dates                             | 500g           |                |   3.89 | 40g            | 1/2 cup        |              140 | 1g              | 0g          |                            |                            |                2.223 |               31.120 |           |                                                                                                                                                    |
  | dijon mustard                     |                | 325ml          |   2.18 |                | 1 tsp          |                5 | 0.4g            | 0g          |                            |                            |                6.708 |                8.385 |           | PC                                                                                                                                                 |
  | ditali                            | 454g           |                |   1.99 | 85g            | 1/2 cup        |              310 | 11g             | 1.5g        |                            |                            |                1.202 |                3.387 |           |                                                                                                                                                    |
  | dried apples                      | 200g           |                |   3.99 | 40g            | 1/2 cup        |              110 | 0.4g            |             |                            | 1/2 cup                    |                7.255 |              199.500 |           |                                                                                                                                                    |
  | dried apricots                    | 500g           |                |   4.89 | 40g            | 1/3 cup        |              120 | 1g              |             |                            | 1/3 cup                    |                3.260 |               39.120 |           | NN                                                                                                                                                 |
  | dried blueberries                 | 500g           |                |   9.99 | 40g            | 1/4 cup        |              140 | 0.5g            |             |                            | 1/4 cup                    |                5.709 |              159.840 |           | PC                                                                                                                                                 |
  | dried cherries                    | 170g           |                |   5.99 | 40g            | 1/4 cup        |              140 | 1g              | 0g          |                            | 1/4 cup                    |               10.067 |              140.941 |           |                                                                                                                                                    |
  | dried cranberries                 | 750g           |                |   6.79 | 40g            | 1/3 cup        |              140 | 0.4g            |             |                            | 1/3 cup                    |                2.587 |               90.533 |           | NN                                                                                                                                                 |
  | dried mango                       | 100g           |                |   2.89 | 42g            | 0.27 cup       |              160 | 0g              | 0g          |                            |                            |                7.586 |                      |           |                                                                                                                                                    |
  | dried mushrooms                   | 113g           |                |   2.99 | 43g            | 1.02 cup       |               70 | 7g              | 0.5g        |                            |                            |               16.254 |               16.254 |           | shiitake mushrooms purchased from local oriental store                                                                                             |
  | dried papaya                      | 100g           |                |   1.49 | 100g           | 0.625 cup      |              250 | 5g              | 0g          |                            |                            |                5.960 |               29.800 |           | Sobey's "trail mix" bulk bins [[http://www.calorieking.com/foods/calories-in-dried-fruits-papaya-spears_f-ZmlkPTk1NDcy.html]]                      |
  | dried pineapple                   | 100g           |                |   1.49 | 100g           | 0.625 cup      |              325 | 2.5g            | 2.5g        |                            |                            |                4.585 |               59.600 |           | Sobey's "trail mix" bulk bins, [[http://www.calorieking.com/foods/calories-in-dried-fruits-pineapple-rings_f-ZmlkPTExMzA1NA.html]]                 |
  | dried tomato                      | 85g            |                |   3.79 | 5g             | 1 tbsp         |               15 | 1g              | 0g          |                            |                            |               14.863 |               22.294 |           | Mezzetta sun-ripened dried tomatos                                                                                                                 |
  | dried vegetables                  | 1kg            |                |  11.90 | 39g            | 1/2 cup        |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | dry mustard                       | 100g           |                |   2.39 | 0.5g           | 1/4 tsp        |                0 | 0.1g            | 0g          |                            |                            |                      |               11.950 |           |                                                                                                                                                    |
  | duncan heines fudge cake mix      | 515g           |                |   2.47 | 43g            |                |              170 | 2g              | 3.5g        |                            |                            |                1.213 |               10.312 |           |                                                                                                                                                    |
  | elbow macaroni                    | 2kg            |                |   3.58 | 85g            | 2/3 cup        |              310 | 10g             |             |                            |                            |                0.491 |                1.522 |           |                                                                                                                                                    |
  | extra lean ground beef            | 615g           |                |   7.17 | 100g           | 1/2 cup        |              180 |                 |             |                            |                            |                6.477 |                      |           | Safeway                                                                                                                                            |
  | frozen NN vegetables              | 2kg            |                |   3.97 | 85g            | 1/2 cup        |               60 | 3g              | 0g          |                            |                            |                2.812 |                5.624 |           |                                                                                                                                                    |
  | frozen blueberries                | 600g           |                |   3.97 | 140g           | 1 1/4 cup      |               80 | 0.3g            | 0.2g        |                            |                            |               11.579 |              308.778 |           |                                                                                                                                                    |
  | frozen cauliflower                | 500g           |                |   3.17 | 85g            | 1/2 cup        |               15 | 1g              | 0g          |                            |                            |               35.927 |               53.890 |           |                                                                                                                                                    |
  | frozen corn                       | 2kg            |                |   2.27 | 85g            | 1/2 cup        |               80 | 3g              | 0g          |                            |                            |                1.206 |                3.216 |           |                                                                                                                                                    |
  | frozen green beans                | 500g           |                |   2.98 | 85g            | 1/2 cup        |               25 | 1g              | 0g          |                            |                            |               20.264 |               50.660 |           |                                                                                                                                                    |
  | frozen peas                       | 2kg            |                |   3.97 | 85g            | 1/2 cup        |               60 | 4g              | 0g          |                            |                            |                2.812 |                4.218 |           |                                                                                                                                                    |
  | frozen spinach                    | 300g           |                |   1.50 | 75g            |                |               25 | 3g              | 0.5g        |                            |                            |               15.000 |               12.500 |           |                                                                                                                                                    |
  | garlic                            |                |                |        | 136g           | 1 cup          |              181 | 8.6g            | 0.7g        |                            |                            |                      |                      |           |                                                                                                                                                    |
  | granola                           | 750g           |                |   4.69 | 55g            |                |              230 | 5g              | 2.5g        |                            |                            |                1.495 |                6.879 |           | PC raisin and almond                                                                                                                               |
  | ground coffee                     | 454g           |                |   8.99 | 78g            | 1 cup          |                0 | 0g              | 0g          |                            |                            |                      |                      |           | PC Sumatran                                                                                                                                        |
  | hazelnuts                         | 100g           |                |   4.99 | 40g            | 1/3 cup        |              270 | 6g              | 24g         |                            |                            |                7.393 |               33.267 |           | filberts                                                                                                                                           |
  | honey                             |                | 375g           |   3.97 |                | 1 cup          |             1031 | 1g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | icing sugar                       | 1kg            |                |        | 25g            | 2 tbsp         |              100 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | instant rice stick noodles        | 225g           |                |   1.99 | 75g            |                |              270 | 5g              | 0.5g        |                            |                            |                2.457 |               13.267 |           |                                                                                                                                                    |
  | ju jubes                          | 1kg            | 200            |   4.49 | 40g            | 8              |              130 | 0.2g            | 0g          |                            |                            |                1.382 |               89.800 |           | NN                                                                                                                                                 |
  | ketchup                           |                | 1.5L           |   4.87 |                | 1 tbsp         |               20 | 0.3g            | 0g          |                            |                            |                2.435 |               16.233 |           |                                                                                                                                                    |
  | kidney beans                      | 900g           |                |        | 92g            | 1/2 cup        |              320 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | large eggs                        |                | 12             |   2.99 | 55g            | 1              |               72 | 6.3g            | 4.8g        |                            |                            |                3.461 |                3.955 |           |                                                                                                                                                    |
  | lean ground beef                  | 0.766 kg       |                |   7.11 | 100g           | 1/2 cup        |              220 | 20g             | 15g         |                            |                            |                4.219 |                4.641 |           | Superstore                                                                                                                                         |
  | lemon juice                       |                | 946 ml         |   1.99 |                | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | life                              | 450g           |                |   4.00 | 32g            | 3/4 cup        |              119 | 3g              | 1g          |                            | 3/4 cup                    |                2.390 |                9.481 |           |                                                                                                                                                    |
  | lime juice                        |                | 440ml          |   2.38 |                | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | lite salt                         | 311g           |                |   5.99 | 1.3g           | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | maple syrup                       |                |                |   8.99 |                | 30 ml          |              100 |                 |             |                            |                            |                      |                      |           | PC                                                                                                                                                 |
  | margarine                         | 3lb            |                |   3.47 | 10g            | 2 tsp          |               70 | 0g              | 8g          |                            |                            |                0.364 |                      |           |                                                                                                                                                    |
  | mayonnaise                        |                | 890ml          |        |                | 1 tbsp         |              100 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | medium carrots                    | 908g           | 18             |   1.97 | 61g            | 1              |               22 | 0.48g           | 0.13g       |                            |                            |                6.016 |               27.572 |           |                                                                                                                                                    |
  | medium onions                     | 1.456kg        | 9              |   2.97 | 141g           |                |               69 | 1.60g           | 0.114g      |                            |                            |                4.168 |               17.976 |           |                                                                                                                                                    |
  | medium potatoes                   | 10lb           |                |   4.97 |                | 1              |              164 |                 |             |                            |                            |                      |                      |           | TODO find out how much potato weights                                                                                                              |
  | medium sweet potato               | 1kg            |                |   2.60 | 200g           | 1 cup          |              180 |                 |             |                            |                            |                2.889 |                      |           | medium                                                                                                                                             |
  | minute rice                       | 2.6kg          |                |   8.79 | 44g            | 1/2 cup        |              160 | 4g              | 0g          |                            |                            |                0.930 |                3.719 |           |                                                                                                                                                    |
  | molasses                          | 675g           |                |   3.49 | 20g            | 1 tbsp         |               60 | 0.2g            | 0g          |                            |                            |                1.723 |               51.704 |           |                                                                                                                                                    |
  | mozzarella cheese                 | 200g           |                |   3.88 | 30g            | 72ml           |               90 | 9g              | 5g          |                            |                            |                6.467 |                6.467 |           |                                                                                                                                                    |
  | no-boil lasagna noodles           | 375g           | 22             |   3.47 | 85g            | 5              |              320 | 11g             | 1.5g        |                            |                            |                2.458 |                7.150 |           | Catelli                                                                                                                                            |
  | nutmeg                            | 100g           |                |   2.99 | 1g             | 1/2 tsp        |                5 |                 |             |                            |                            |                5.980 |                      |           |                                                                                                                                                    |
  | olive oil                         |                | 3L             |  15.98 |                | 2 tsp          |               80 | 0g              | 9g          |                            |                            |                0.666 |                      |           |                                                                                                                                                    |
  | onion                             | 1.456kg        |                |   2.97 | 141g           | 1 cup          |               69 | 1.511g          | 0.107g      |                            |                            |                4.168 |               19.035 |           | 3lb bag, diced                                                                                                                                     |
  | onion soup mix                    | 80g            |                |   1.48 | 10g            |                |               30 | 1g              | 0g          |                            |                            |                6.167 |               18.500 |           | NN                                                                                                                                                 |
  | orange juice                      |                | 1.75L          |   3.98 |                | 250ml          |              110 | 2g              | 0g          |                            |                            |                5.169 |               28.429 |           |                                                                                                                                                    |
  | peanuts                           | 2kg            |                |   8.49 | 45g            | 1/3 cup        |              290 | 10g             | 23g         |                            |                            |                0.659 |                1.910 |           | NN                                                                                                                                                 |
  | pecans                            | 1kg            |                |  19.99 | 36g            | 1/3 cup        |              270 | 3g              | 26g         |                            |                            |                2.665 |               23.988 |           | NN halves, want chopped                                                                                                                            |
  | pepperoni stick                   | 40g            |                |   1.49 | 40g            |                |              260 | 10g             | 24g         |                            |                            |                5.731 |               14.900 |           |                                                                                                                                                    |
  | pinto beans                       | 900g           |                |   2.99 | 97g            | 1/2 cup        |              340 | 21g             | 1g          |                            |                            |                0.948 |                1.535 |           | (dried)                                                                                                                                            |
  | poppy seeds                       | 150g           |                |   2.10 | 0.5g           | 1/4 tsp        |                0 | 0.1g            | 0g          |                            |                            |                      |                7.000 |           |                                                                                                                                                    |
  | pumpkin                           |                | 796 ml         |        |                | 1/3 cup        |               35 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | quick oats                        | 2.25kg         |                |   4.99 | 30g            | 1/3 cup        |              110 | 5g              | 2g          |                            |                            |                0.605 |                1.331 |           |                                                                                                                                                    |
  | raisin bran                       | 625g           |                |   4.94 | 59g            | 1 cup          |              190 | 5g              | 1g          |                            |                            |                2.454 |                9.327 |           |                                                                                                                                                    |
  | raisins                           | 2kg            |                |   7.99 | 40g            | 1/4 cup        |              130 | 1g              | 0g          |                            | 1/4 cup                    |                1.229 |               15.980 |           | NN Thompson                                                                                                                                        |
  | red lentils                       | 10kg           |                |  10.99 | 96g            | 1/2 cup        |              340 | 25g             | 1g          |                            |                            |                0.310 |                0.422 |           |                                                                                                                                                    |
  | red wine vinegar                  |                | 1L             |   3.49 |                | 15ml           |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | rice                              | 8kg            |                |  13.99 | 45g            | 1/4 cup        |              160 |                 |             |                            |                            |                0.492 |                      |           |                                                                                                                                                    |
  | rice krispies                     | 640g           |                |   6.44 | 33g            | 1 1/4 cup      |              130 | 2.4g            | 0g          |                            | 1 1/4 cup                  |                2.554 |               13.836 |           |                                                                                                                                                    |
  | rolled oats                       | 2.25kg         |                |   4.99 | 40g            | 1/3 cup        |              110 | 5g              | 2g          |                            |                            |                0.806 |                1.774 |           | TODO: need a consistent price/nutrition                                                                                                            |
  | rotini                            | 5lbs           |                |   9.99 | 85g            |                |              290 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | salt                              | 1kg            |                |   2.99 | 1g             | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | sandwich ziplock                  |                | 400            |  10.47 |                |                |                  |                 |             |                            |                            |                      |                      | packaging |                                                                                                                                                    |
  | sesame oil                        |                | 185ml          |   2.98 |                | 2 tsp          |               80 | 0g              | 9g          |                            |                            |                2.014 |                      |           |                                                                                                                                                    |
  | sesame seeds                      | 150g           |                |   1.59 | 8.5g           | 1 tbsp         |               52 | 1.6g            | 4.5g        |                            |                            |                1.733 |                5.631 |           |                                                                                                                                                    |
  | shortening                        | 3lb            |                |   6.86 | 8g             | 2 tsp          |               70 | 0g              | 8g          |                            |                            |                0.576 |                      |           |                                                                                                                                                    |
  | shredded carrots                  | 908g           |                |   1.97 | 125g           | 1 cup          |           52.439 | 1.184           | 0.3383      |                            |                            |                5.172 |               22.905 |           |                                                                                                                                                    |
  | shreddies                         | 540g           |                |   4.00 | 50g            | 1 cup          |              180 | 1g              | 4g          |                            | 1 cup                      |                2.058 |               37.037 |           |                                                                                                                                                    |
  | skim milk powder                  | 500g           |                |   7.49 | 25g            | 4 tbsp         |               90 | 9g              | 0g          |                            |                            |                4.161 |                4.161 |           |                                                                                                                                                    |
  | sliced almonds                    | 1kg            |                |  12.99 | 30g            | 1/4 cup        |              190 | 6g              | 16g         |                            |                            |                2.051 |                6.495 |           |                                                                                                                                                    |
  | small potato                      | 6              | 0.79kg         |   1.69 |                |                |                  |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | soy sauce                         |                | 1.89L          |   6.99 |                | 1 tbsp         |               10 | 2g              | 0g          |                            |                            |                5.548 |                2.774 |           | (Kikoman)                                                                                                                                          |
  | spaghetti                         | 900g           |                |   1.77 | 85g            |                |              310 | 11g             | 1.5g        |                            |                            |                0.539 |                1.520 |           |                                                                                                                                                    |
  | spaghettini                       | 900g           |                |   1.77 | 82g            |                |              310 | 11g             | 1.5g        |                            |                            |                0.520 |                1.466 |           |                                                                                                                                                    |
  | split peas                        | 900g           |                |   2.59 | 100g           | 1/2 cup        |              350 | 20g             | 1g          |                            |                            |                0.822 |                1.439 |           |                                                                                                                                                    |
  | spoon size shredded wheat         |                |                |        | 48.195g        | 1 cup          |              170 | 6g              | 1g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | stalks celery                     | 933g           | 12             |   1.18 |                | 1              |            16.29 | 0.7238g         | 0.1809g     |                            |                            |                6.036 |               13.586 |           | Total bunch weight: 1.142kg                                                                                                                        |
  | strawberries                      | 2lb            |                |   2.87 | 144g           | 1 cup          |               46 |                 |             |                            |                            |                9.904 |                      |           |                                                                                                                                                    |
  | strips bacon                      | 500g           | 20             |   3.98 | 50g            | 2              |              200 | 4g              | 19g         |                            |                            |                1.990 |                9.950 |           | (per slice)                                                                                                                                        |
  | sunflower seeds                   | 100g           |                |   0.79 | 70g            | 1/2 cup        |              407 | 13.5g           | 34.9g       |                            |                            |                1.359 |                4.096 |           |                                                                                                                                                    |
  | sweet potato                      | 1kg            |                |   1.01 | 131g           | 1 cup          |            112.8 | 2.042g          | 0.1075g     |                            |                            |                1.173 |                6.479 |           | diced                                                                                                                                              |
  | thyme                             | 45g            |                |   1.67 | 0.5g           | 1/2 tsp        |                0 |                 |             |                            |                            |                      |                      | spice     |                                                                                                                                                    |
  | traditional yeast                 | 227g           |                |   7.98 | 8g             | 2 1/4 tsp      |                0 | 0.3g            | 0g          |                            |                            |                      |               93.744 |           |                                                                                                                                                    |
  | unsweetened cocoa powder          | 250g           |                |   2.99 | 5g             | 1 tbsp         |               20 | 1g              | 0.5g        |                            |                            |                2.990 |                5.980 |           |                                                                                                                                                    |
  | unsweetened coconut               | 200g           |                |   1.99 | 12g            | 2 tbsp         |               90 | 1g              | 7g          |                            |                            |                1.327 |               11.940 |           |                                                                                                                                                    |
  | vanilla extract                   |                | 250ml          |   3.00 | 5g             | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |           |                                                                                                                                                    |
  | vegetable broth                   |                | 900ml          |   2.99 |                | 1 cup          |               10 | 0.3g            | 0g          |                            |                            |               79.733 |              265.778 |           | PC organic                                                                                                                                         |
  | vegetable oil                     |                | 3L             |   5.99 | 14g            | 2 tsp          |               80 | 0g              | 9g          |                            |                            |                0.250 |                      |           | using canola oil, TODO: get nutrition for best price                                                                                               |
  | veggie bullion powder             | 150g           |                |   5.99 | 3.4g           | 1 tsp          |               10 | 0.1g            | 0g          |                            |                            |               13.577 |              135.773 |           |                                                                                                                                                    |
  | walnuts                           | 1kg            |                |  12.99 | 40g            | 1/3 cup        |              280 | 6g              | 26g         |                            | 1/3 cup                    |                1.856 |                8.660 |           | NN pieces                                                                                                                                          |
  | water                             |                | 1L             |   0.00 |                | 1 ml           |                0 |                 |             |                            |                            |                      |                      |           |                                                                                                                                                    |
  | wheat germ                        | 375g           |                |   2.98 | 16g            | 3 tbsp         |               60 | 5g              | 1.5g        |                            |                            |                2.119 |                2.543 |           |                                                                                                                                                    |
  | white beans                       | 900g           |                |   2.99 |                | 1/3 cup        |              250 |                 |             |                            |                            |                      |                      |           | (dried)                                                                                                                                            |
  | white sugar                       | 4kg            |                |   5.27 | 12g            | 1 tbsp         |               48 | 0g              | 0g          |                            |                            |                0.329 |                      |           |                                                                                                                                                    |
  | whole-wheat flour                 | 5kg            |                |   4.98 | 30g            | 1/4 cup        |              110 | 4g              | 0.5g        |                            |                            |                0.272 |                0.747 |           |                                                                                                                                                    |
  |-----------------------------------+----------------+----------------+--------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+-----------+----------------------------------------------------------------------------------------------------------------------------------------------------|
  #+TBLFM: $12='(nts-nan (ignore-errors (otdb-recipe-database-calorie-costs $2 $3 $4 $5 $6 $7)))::$13='(nts-nan (ignore-errors (otdb-recipe-database-protein-costs $2 $3 $4 $5 $6 $8)))
